---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhasea
source: html/fff0c470-7d98-53c4-d6fc-435714195a74.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelBranchCircuitApparentLoadPhasea Property

"Branch Circuit Apparent Load Phase A"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelBranchCircuitApparentLoadPhasea { get; }
```